
function getValueLabel(dict) {
  const valueLabel = [];
  for (const [value, label] of Object.entries(dict)) {
    valueLabel.push({ value, label });
  }
  return valueLabel
}

const captain = {
  '10700': '吟游诗人队长',
  '11300': '矮人坦克队长',
  '11400': '人类牧师队长',
  '11500': '巨剑战士队长',
  '11600': '利爪刺客队长',
  '11700': '精灵弓箭手队长',
  '11900': '雷电法师队长',
  '12000': '亡灵术士队长',
  '12100': '熊人坦克队长',
  '12200': '提夫林火法队长',
}

const units = {
  '22300': '犀士多',
  '22600': '烈焰萨满',
  '22800': '骨蕾娅',
  '22900': '锤皮巴拉',
  '23000': '塔顿·地斧',
  '23200': '沫沫',
  '23300': '辉叶莉兹',
  '23400': '喵瑟夫',
  '23500': '利爪哈迪',
  '23600': '传令官',
  '23700': '樵夫查狸',
  '23800': '针太郎',
  '23900': '毒刺',
  '24000': '宝藏猎人',
  '24100': '爆裂卡莉',
  '24200': '火枪司令',
  '24300': '花藤小姐',
  '24500': '雷霆娜娜'
}

const advanced_power = {
  '100003': '彩-获得金币时获得宝石',
  '100004': '彩色-金币增伤',
  '100008': '金色-精益求精',
  '100011': '野怪打手',
  '100012': '天眼',
  '100013': '复制体',
  '100014': '终身会员',
  '100015': '彗星子弹',
  '100017': '紧急保护',
  '100018': '强力弩箭',
  '100019': '金色-战力-多职业强化',
  '100020': '变形重组',
  '100021': '黑暗契约',
  '100022': '战功卓著',
  '100023': '幸运儿',
  '100024': '孤注一掷',
  '100025': '幸存者',
  '100026': '庞然大物',
  '100027': '赏金猎人',
  '100028': '妙手空空',
  '100029': '饱和治疗',
  '100030': '廉价施法',
  '100031': '意外收获',
  '100032': '天赐之物'
}

const relic = {
  '100002': '银色-经济-击杀精英额外金币',
  '100003': '金色-守护复苏',
  '100004': '金色-射手连击',
  '100005': '金色-战士强攻',
  '100006': '金色-辅助减疗',
  '100007': '金色-法师冷却',
  '100008': '金色-战力-增加战士攻击',
  '100009': '金色-战力-增加射手攻速',
  '100010': '金色-战力-增加守护血量',
  '100011': '金色-免费宝箱',
  '100012': '彩色-经济-开箱加速及额外宝石',
  '100013': '银色-战力-击杀回耐',
  '100014': '金色-经济-开箱额外宝石',
  '100015': '金色-战力-全部-加速',
  '100016': '金色-经济-宝箱价格降低',
  '100017': '彩色-战力-生命强化主近战',
  '100018': '彩色-战力-攻速强化主远程',
  '100019': '金色-超级有力',
  '100020': '求生意志',
  '100021': '魔力汲取',
  '100022': '力量代价',
  '100023': '悬赏令',
  '100024': '召唤宝石',
  '100025': '金色-战力-增加法师伤害'
}

const fitness = {
  '101001': '数值强化-银-生命增加',
  '101002': '数值强化-银-攻击增加',
  '101003': '数值强化-银-攻速增加',
  '101004': '数值强化-银-减伤增加',
  '101005': '数值强化-银-护盾效果增加',
  '101006': '数值强化-银-治疗效果增加',
  '102001': '数值强化-金-生命增加',
  '102002': '数值强化-金-攻击增加',
  '102003': '数值强化-金-攻速增加',
  '102004': '数值强化-金-减伤增加',
  '102005': '数值强化-金-护盾效果增加',
  '102006': '数值强化-金-治疗效果增加',
  '102007': '荣誉勋章',
  '103001': '数值强化-彩-生命增加',
  '103002': '数值强化-彩-攻击增加',
  '103003': '数值强化-彩-攻速增加',
  '103004': '数值强化-彩-减伤增加',
  '103005': '数值强化-彩-护盾效果增加',
  '103006': '数值强化-彩-治疗效果增加',
  '103007': '彩-闪电链',
  '103008': '彩-点燃',
  '103009': '彩-反击风暴',
  '103010': '银色-额外子弹',
  '103011': '银色-战力-小兵-半血回复'
}

const hex = {
  '10027': '金色-吟游诗人队长专属强化',
  '10033': '金色-矮人坦克队长专属强化',
  '10034': '金色-雷电法师队长专属强化',
  '10035': '金色-利爪刺客队长专属强化',
  '10036': '金色-精灵弓箭手队长专属强化',
  '10037': '金色-人类牧师队长专属强化',
  '10038': '金色-巨剑战士队长专属强化',
  '10039': '金色-亡灵术士队长专属强化',
  '10040': '金色-提夫林火法队长专属强化',
  '10041': '金色-熊人坦克队长专属强化'
}

const indexMap = [captain, units, advanced_power, relic, fitness, hex]

const metricsMap = {
  "平均输出": "avg_damage",
  "平均治疗": "avg_heal",
  "avg_damage": "平均输出",
  "avg_heal": "平均治疗",
}

export {
  captain,
  units,
  advanced_power,
  relic,
  fitness,
  hex,
  indexMap,
  metricsMap,
}

export {
  getValueLabel,
}